In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {

    "Name": ["a","b","c"],
    "Age": [20,25,32]
}
df = pd.DataFrame(data)
df

  Name  Age
0    a   20
1    b   25
2    c   32

In [5]:
df = pd.read_csv("data.csv")
df

      Name  Age   Salary
0    Hasan   32    100.0
1      Ali   15    233.0
2    Vahid   23   3123.0
3  Hossain   54  32232.0
4    Nader   33    122.0
5  Ghorban  323      NaN

In [6]:
df.head()

      Name  Age   Salary
0    Hasan   32    100.0
1      Ali   15    233.0
2    Vahid   23   3123.0
3  Hossain   54  32232.0
4    Nader   33    122.0

In [7]:
df.describe()

             Age        Salary
count    6.00000      5.000000
mean    80.00000   7162.000000
std    119.75976  14073.582575
min     15.00000    100.000000
25%     25.25000    122.000000
50%     32.50000    233.000000
75%     48.75000   3123.000000
max    323.00000  32232.000000

In [11]:
df['Name']

0      Hasan
1        Ali
2      Vahid
3    Hossain
4      Nader
5    Ghorban
Name: Name, dtype: object

In [13]:
df.iloc[3,0]

'Hossain'

In [14]:
filitered_df = df[df["Salary"]>100]
filitered_df

      Name  Age   Salary
1      Ali   15    233.0
2    Vahid   23   3123.0
3  Hossain   54  32232.0
4    Nader   33    122.0

In [16]:
df_sorted = df.sort_values("Salary")
df_sorted

      Name  Age   Salary
0    Hasan   32    100.0
4    Nader   33    122.0
1      Ali   15    233.0
2    Vahid   23   3123.0
3  Hossain   54  32232.0
5  Ghorban  323      NaN

In [17]:
subset = df.loc[2:4,["Name","Age"]]
subset

      Name  Age
2    Vahid   23
3  Hossain   54
4    Nader   33

In [ ]:
0